<?php
return [
    400012000 => [
        'name' => '北九州市立大学',
        'fuculty' => [
            0 => '外国語学部',
            1 => '経済学部',
            2 => '文学部',
            3 => '法学部',
            4 => '地域創生学群',
            5 => '国際環境工学部',
        ],
        'class' => [
            0 => [
                0 => '英米学科',
                1 => '中国学科',
                2 => '国際関係学科',
            ],
            1 => [
                0 => '経済学科',
                1 => '経営情報学科',
            ],
            2 => [
                0 => '比較文化学科',
                1 => '人間関係学科',
            ],
            3 => [
                0 => '法律学科',
                1 => '政策科学科',
            ],
            4 => [
                0 => '地域創生学類',
            ],
            5 => [
                0 => 'エネルギー循環化学科',
                1 => '機械システム工学科',
                2 => '情報システム工学科',
                3 => '建築デザイン学科',
                4 => '環境生命工学科',
            ],
        ]
    ],
    400011001 => [
        'name' => '九州大学',
        'fuculty' => [
            0 => '文学部',
            1 => '教育学部',
            2 => '法学部',
            3 => '経済学部',
            4 => '理学部',
            5 => '医学部',
            6 => '歯学部',
            7 => '薬学部',
            8 => '工学部',
            9 => '芸術工学部',
            10 => '農学部',
            11 => '共創学部',
        ],
        'class' => [
            0 => [
                0 => '人文学科',
            ],
            1 => [],
            2 => [],
            3 => [
                0 => '経済・経営学科',
                1 => '経済工学科',
            ],
            4 => [
                0 => '物理学科',
                1 => '化学科',
                2 => '地球惑星科学科',
                3 => '数学科',
                4 => '生物学科',
            ],
            5 => [
                0 => '医学科',
                1 => '生命科学科',
                2 => '保健学科',
            ],
            6 => [
                0 => '歯学科',
            ],
            7 => [
                0 => '創薬科学科＜４年制＞',
                1 => '臨床薬学科＜６年制＞',
            ],
            8 => [
                0 => '建築学科',
                1 => '電気情報工学科',
                2 => '物質科学工学科',
                3 => '地球環境工学科',
                4 => 'エネルギー科学科',
                5 => '機械航空工学科',
            ],
            9 => [
                0 => '芸術工学科',
            ],
            10 => [
                0 => '生物資源環境学科',
            ],
            11 => [
                0 => '共創学科',
            ],
        ]
    ],
    400013000 => [
        'name' => '九州栄養福祉大学',
        'fuculty' => [
            0 => '食物栄養学部',
            1 => 'リハビリテーション学部',
        ],
        'class' => [
            0 => [
                0 => '食物栄養学科',
            ],
            1 => [
                0 => '理学療法学科',
                1 => '作業療法学科',
            ],
        ]
    ],
    400013001 => [
        'name' => '九州共立大学',
        'fuculty' => [
            0 => '経済学部',
            1 => 'スポーツ学部',
        ],
        'class' => [
            0 => [
                0 => '経済・経営学科',
                1 => '地域創造学科',
            ],
            1 => [
                0 => 'スポーツ学科',
            ],
        ]
    ],
    400011000 => [
        'name' => '九州工業大学',
        'fuculty' => [
            0 => '工学部',
            1 => '情報工学部',
        ],
        'class' => [
            0 => [
                0 => '建設社会工学科',
                1 => '機械知能工学科',
                2 => '宇宙システム工学科',
                3 => '電気電子工学科',
                4 => '応用化学科',
                5 => 'マテリアル工学科',
            ],
            1 => [
                0 => '知能情報工学科',
                1 => '情報・通信工学科',
                2 => '知的システム工学科',
                3 => '物理情報工学科',
                4 => '生命化学情報工学科',
            ],
        ]
    ],
    400013002 => [
        'name' => '九州国際大学',
        'fuculty' => [
            0 => '法学部',
            1 => '現代ビジネス学部',
        ],
        'class' => [
            0 => [
                0 => '法律学科',
            ],
            1 => [
                0 => '地域経済学科',
                1 => '国際社会学科',
            ],
        ]
    ],
    400013003 => [
        'name' => '九州産業大学',
        'fuculty' => [
            0 => '国際文化学部',
            1 => '人間科学部',
            2 => '経済学部',
            3 => '商学部',
            4 => '地域共創学部',
            5 => '理工学部',
            6 => '生命科学部',
            7 => '建築都市工学部',
            8 => '芸術学部',
        ],
        'class' => [
            0 => [
                0 => '国際文化学科',
                1 => '日本文化学科',
            ],
            1 => [
                0 => '臨床心理学科',
                1 => '子ども教育学科',
                2 => 'スポーツ健康科学科',
            ],
            2 => [
                0 => '経済学科',
            ],
            3 => [
                0 => '経営・流通学科',
            ],
            4 => [
                0 => '観光学科',
                1 => '地域づくり学科',
            ],
            5 => [
                0 => '情報科学科',
                1 => '機械工学科',
                2 => '電気工学科',
            ],
            6 => [
                0 => '生命科学科',
            ],
            7 => [
                0 => '建築学科',
                1 => '住居・インテリア学科',
                2 => '都市デザイン工学科',
            ],
            8 => [
                0 => '芸術表現学科',
                1 => '写真・映像メディア学科',
                2 => 'ビジュアルデザイン学科',
                3 => '生活環境デザイン学科',
                4 => 'ソーシャルデザイン学科',
            ],
        ]
    ],
    400012001 => [
        'name' => '九州歯科大学',
        'fuculty' => [
            0 => '歯学部',
        ],
        'class' => [
            0 => [
                0 => '歯学科',
                1 => '口腔保健学科',
            ],
        ]
    ],
    400013004 => [
        'name' => '九州情報大学',
        'fuculty' => [
            0 => '経営情報学部',
        ],
        'class' => [
            0 => [
                0 => '経営情報学科',
                1 => '情報ネットワーク学科',
            ],
        ]
    ],
    400013005 => [
        'name' => '九州女子大学',
        'fuculty' => [
            0 => '家政学部',
            1 => '人間科学部',
        ],
        'class' => [
            0 => [
                0 => '人間生活学科',
                1 => '栄養学科',
            ],
            1 => [
                0 => '人間発達学科',
            ],
        ]
    ],
    400013006 => [
        'name' => '近畿大学',
        'fuculty' => [
            0 => '法学部',
            1 => '経済学部',
            2 => '経営学部',
            3 => '理工学部',
            4 => '建築学部',
            5 => '薬学部',
            6 => '文芸学部',
            7 => '総合社会学部',
            8 => '国際学部',
            9 => '農学部',
            10 => '医学部',
            11 => '生物理工学部',
            12 => '工学部',
            13 => '産業理工学部',
        ],
        'class' => [
            0 => [
                0 => '法律学科',
            ],
            1 => [
                0 => '経済学科',
                1 => '国際経済学科',
                2 => '総合経済政策学科',
            ],
            2 => [
                0 => '経営学科',
                1 => '商学科',
                2 => '会計学科',
                3 => 'キャリア・マネジメント学科',
            ],
            3 => [
                0 => '理学科',
                1 => '生命科学科',
                2 => '応用化学科',
                3 => '機械工学科',
                4 => '電気電子工学科',
                5 => '情報学科',
                6 => '社会環境工学科',
            ],
            4 => [
                0 => '建築学科',
            ],
            5 => [
                0 => '医療薬学科（６年制）',
                1 => '創薬科学科（４年制）',
            ],
            6 => [
                0 => '文学科',
                1 => '芸術学科',
                2 => '文化・歴史学科',
                3 => '文化デザイン学科',
            ],
            7 => [
                0 => '総合社会学科',
            ],
            8 => [
                0 => '国際学科',
            ],
            9 => [
                0 => '農業生産科学科',
                1 => '水産学科',
                2 => '応用生命化学科',
                3 => '食品栄養学科',
                4 => '環境管理学科',
                5 => '生物機能科学科',
            ],
            10 => [
                0 => '医学科',
            ],
            11 => [
                0 => '生物工学科',
                1 => '遺伝子工学科',
                2 => '食品安全工学科',
                3 => '生命情報工学科',
                4 => '人間環境デザイン工学科',
                5 => '医用工学科',
            ],
            12 => [
                0 => '化学生命工学科',
                1 => '機械工学科',
                2 => 'ロボティクス学科',
                3 => '電子情報工学科',
                4 => '情報学科',
                5 => '建築学科',
            ],
            13 => [
                0 => '生物環境化学科',
                1 => '電気電子工学科',
                2 => '建築・デザイン学科',
                3 => '情報学科',
                4 => '経営ビジネス学科',
            ],
        ]
    ],
    400013007 => [
        'name' => '久留米工業大学',
        'fuculty' => [
            0 => '工学部',
        ],
        'class' => [
            0 => [
                0 => '機械システム工学科',
                1 => '交通機械工学科',
                2 => '建築・設備工学科',
                3 => '情報ネットワーク工学科',
                4 => '教育創造工学科',
            ],
        ]
    ],
    400013008 => [
        'name' => '久留米大学',
        'fuculty' => [
            0 => '文学部',
            1 => '人間健康学部',
            2 => '法学部',
            3 => '経済学部',
            4 => '商学部',
            5 => '医学部',
        ],
        'class' => [
            0 => [
                0 => '心理学科',
                1 => '情報社会学科',
                2 => '国際文化学科',
                3 => '社会福祉学科',
            ],
            1 => [
                0 => '総合子ども学科',
                1 => 'スポーツ医科学科',
            ],
            2 => [
                0 => '法律学科',
                1 => '国際政治学科',
            ],
            3 => [
                0 => '経済学科',
                1 => '文化経済学科',
            ],
            4 => [
                0 => '商学科',
            ],
            5 => [
                0 => '医学科',
                1 => '看護学科',
            ],
        ]
    ],
    400013009 => [
        'name' => '国際医療福祉大学',
        'fuculty' => [
            0 => '医学部',
            1 => '保健医療学部',
            2 => '医療福祉学部',
            3 => '薬学部',
            4 => '成田看護学部',
            5 => '成田保健医療学部',
            6 => '赤坂心理・医療福祉マネジメント学部',
            7 => '小田原保健医療学部',
            8 => '福岡看護学部',
            9 => '福岡保健医療学部',
            10 => '福岡薬学部',
        ],
        'class' => [
            0 => [
                0 => '医学科',
            ],
            1 => [
                0 => '看護学科',
                1 => '理学療法学科',
                2 => '作業療法学科',
                3 => '言語聴覚学科',
                4 => '視機能療法学科',
                5 => '放射線・情報科学科',
            ],
            2 => [
                0 => '医療福祉・マネジメント学科',
            ],
            3 => [
                0 => '薬学科（６年制）',
            ],
            4 => [
                0 => '看護学科',
            ],
            5 => [
                0 => '理学療法学科',
                1 => '作業療法学科',
                2 => '言語聴覚学科',
                3 => '医学検査学科',
                4 => '放射線・情報科学科',
            ],
            6 => [
                0 => '心理学科',
                1 => '医療マネジメント学科',
            ],
            7 => [
                0 => '看護学科',
                1 => '理学療法学科',
                2 => '作業療法学科',
            ],
            8 => [
                0 => '看護学科',
            ],
            9 => [
                0 => '理学療法学科',
                1 => '作業療法学科',
                2 => '言語聴覚学科',
                3 => '医学検査学科',
            ],
            10 => [
                0 => '薬学科',
            ],
        ]
    ],
    400013010 => [
        'name' => 'サイバー大学',
        'fuculty' => [
            0 => 'ＩＴ総合学部',
        ],
        'class' => [
            0 => [
                0 => 'テクノロジーコース',
                1 => 'ビジネスコース',
                2 => 'ＩＴコミュニケーションコース',
            ],
        ]
    ],
    400013011 => [
        'name' => '産業医科大学',
        'fuculty' => [
            0 => '医学部',
            1 => '産業保健学部',
        ],
        'class' => [
            0 => [
                0 => '医学科',
            ],
            1 => [
                0 => '看護学科',
                1 => '産業衛生科学科',
            ],
        ]
    ],
    400013012 => [
        'name' => '純真学園大学',
        'fuculty' => [
            0 => '保健医療学部',
        ],
        'class' => [
            0 => [
                0 => '看護学科',
                1 => '放射線技術科学科',
                2 => '検査科学科',
                3 => '医療工学科',
            ],
        ]
    ],
    400013013 => [
        'name' => '西南学院大学',
        'fuculty' => [
            0 => '神学部',
            1 => '外国語学部',
            2 => '商学部',
            3 => '経済学部',
            4 => '法学部',
            5 => '人間科学部',
            6 => '国際文化学部',
        ],
        'class' => [
            0 => [
                0 => '神学科',
            ],
            1 => [
                0 => '外国語学科',
            ],
            2 => [
                0 => '商学科',
                1 => '経営学科',
            ],
            3 => [
                0 => '国際経済学科',
                1 => '経済学科',
            ],
            4 => [
                0 => '法律学科',
                1 => '国際関係法学科',
            ],
            5 => [
                0 => '児童教育学科',
                1 => '社会福祉学科',
                2 => '心理学科',
            ],
            6 => [
                0 => '国際文化学科',
            ],
        ]
    ],
    400013014 => [
        'name' => '西南女学院大学',
        'fuculty' => [
            0 => '人文学部',
            1 => '保健福祉学部',
        ],
        'class' => [
            0 => [
                0 => '英語学科',
                1 => '観光文化学科',
            ],
            1 => [
                0 => '看護学科',
                1 => '福祉学科',
                2 => '栄養学科',
            ],
        ]
    ],
    400013015 => [
        'name' => '聖マリア学院大学',
        'fuculty' => [
            0 => '看護学部',
        ],
        'class' => [
            0 => [
                0 => '看護学科',
            ],
        ]
    ],
    400013016 => [
        'name' => '第一薬科大学',
        'fuculty' => [
            0 => '薬学部',
            1 => '看護学部',
        ],
        'class' => [
            0 => [
                0 => '薬学科',
                1 => '漢方薬学科',
            ],
            1 => [
                0 => '看護学科',
            ],
        ]
    ],
    400013017 => [
        'name' => '筑紫女学園大学',
        'fuculty' => [
            0 => '文学部',
            1 => '人間科学部',
            2 => '現代社会学部',
        ],
        'class' => [
            0 => [
                0 => '日本語・日本文学科',
                1 => '英語学科',
                2 => 'アジア文化学科',
            ],
            1 => [
                0 => '人間科学科',
            ],
            2 => [
                0 => '現代社会学科',
            ],
        ]
    ],
    400013018 => [
        'name' => '帝京大学',
        'fuculty' => [
            0 => '医学部',
            1 => '薬学部',
            2 => '経済学部',
            3 => '法学部',
            4 => '文学部',
            5 => '外国語学部',
            6 => '教育学部',
            7 => '理工学部',
            8 => '医療技術学部',
            9 => '福岡医療技術学部',
        ],
        'class' => [
            0 => [
                0 => '医学科',
            ],
            1 => [
                0 => '薬学科',
            ],
            2 => [
                0 => '経済学科',
                1 => '国際経済学科',
                2 => '地域経済学科',
                3 => '経営学科',
                4 => '観光経営学科',
            ],
            3 => [
                0 => '法律学科',
                1 => '政治学科',
            ],
            4 => [
                0 => '日本文化学科',
                1 => '史学科',
                2 => '社会学科',
                3 => '心理学科',
            ],
            5 => [
                0 => '外国語学科',
            ],
            6 => [
                0 => '教育文化学科',
                1 => '初等教育学科',
            ],
            7 => [
                0 => '機械・精密システム工学科',
                1 => '航空宇宙工学科',
                2 => '情報電子工学科',
                3 => 'バイオサイエンス学科',
            ],
            8 => [
                0 => '視能矯正学科',
                1 => '看護学科',
                2 => '診療放射線学科',
                3 => '臨床検査学科',
                4 => 'スポーツ医療学科',
                5 => '柔道整復学科',
            ],
            9 => [
                0 => '理学療法学科',
                1 => '作業療法学科',
                2 => '看護学科',
                3 => '診療放射線学科',
                4 => '医療技術学科',
            ],
        ]
    ],
    400013019 => [
        'name' => '中村学園大学',
        'fuculty' => [
            0 => '栄養科学部',
            1 => '教育学部',
            2 => '流通科学部',
        ],
        'class' => [
            0 => [
                0 => '栄養科学科',
                1 => 'フード・マネジメント学科',
            ],
            1 => [
                0 => '児童幼児教育学科',
            ],
            2 => [
                0 => '流通科学科',
            ],
        ]
    ],
    400013020 => [
        'name' => '西日本工業大学',
        'fuculty' => [
            0 => '工学部',
            1 => 'デザイン学部',
        ],
        'class' => [
            0 => [
                0 => '総合システム工学科',
            ],
            1 => [
                0 => '建築学科',
                1 => '情報デザイン学科',
            ],
        ]
    ],
    400013021 => [
        'name' => '日本赤十字九州国際看護大学',
        'fuculty' => [
            0 => '看護学部',
        ],
        'class' => [
            0 => [
                0 => '看護学科',
            ],
        ]
    ],
    400013022 => [
        'name' => '日本経済大学',
        'fuculty' => [
            0 => '経済学部',
            1 => '経営学部',
        ],
        'class' => [
            0 => [
                0 => '経済学科',
                1 => '商学科',
                2 => '健康スポーツ経営学科',
            ],
            1 => [
                0 => '経営学科',
                1 => 'グローバルビジネス学科',
                2 => '芸創プロデュース学科',
            ],
        ]
    ],
    400013023 => [
        'name' => '福岡看護大学',
        'fuculty' => [
            0 => '看護学部',
        ],
        'class' => [
            0 => [
                0 => '看護学科',
            ],
        ]
    ],
    400011002 => [
        'name' => '福岡教育大学',
        'fuculty' => [
            0 => '教育学部',
        ],
        'class' => [
            0 => [
                0 => '初等教育教員養成課程',
                1 => '中等教育教員養成課程',
                2 => '特別支援教育教員養成課程',
            ],
        ]
    ],
    400012002 => [
        'name' => '福岡県立大学',
        'fuculty' => [
            0 => '人間社会学部',
            1 => '看護学部',
        ],
        'class' => [
            0 => [
                0 => '公共社会学科',
                1 => '社会福祉学科',
                2 => '人間形成学科',
            ],
            1 => [
                0 => '看護学科',
            ],
        ]
    ],
    400013024 => [
        'name' => '福岡工業大学',
        'fuculty' => [
            0 => '工学部',
            1 => '情報工学部',
            2 => '社会環境学部',
        ],
        'class' => [
            0 => [
                0 => '電子情報工学科',
                1 => '生命環境化学科',
                2 => '知能機械工学科',
                3 => '電気工学科',
            ],
            1 => [
                0 => '情報工学科',
                1 => '情報通信工学科',
                2 => '情報システム工学科',
                3 => 'システムマネジメント学科',
            ],
            2 => [
                0 => '社会環境学科',
            ],
        ]
    ],
    400013025 => [
        'name' => '福岡国際医療福祉大学',
        'fuculty' => [
            0 => '医療学部',
        ],
        'class' => [
            0 => [
                0 => '理学療法学科',
                1 => '作業療法学科',
                2 => '視能訓練学科',
            ],
        ]
    ],
    400013026 => [
        'name' => '福岡歯科大学',
        'fuculty' => [
            0 => '口腔歯学部',
        ],
        'class' => [
            0 => [
                0 => '口腔歯学科',
            ],
        ]
    ],
    400013027 => [
        'name' => '福岡女学院看護大学',
        'fuculty' => [
            0 => '看護学部',
        ],
        'class' => [
            0 => [
                0 => '看護学科',
            ],
        ]
    ],
    400013028 => [
        'name' => '福岡女学院大学',
        'fuculty' => [
            0 => '人文学部',
            1 => '人間関係学部',
            2 => '国際キャリア学部',
        ],
        'class' => [
            0 => [
                0 => '現代文化学科',
                1 => '言語芸術学科',
                2 => 'メディア・コミュニケーション学科',
            ],
            1 => [
                0 => '心理学科',
                1 => '子ども発達学科',
            ],
            2 => [
                0 => '国際英語学科',
                1 => '国際キャリア学科',
            ],
        ]
    ],
    400012003 => [
        'name' => '福岡女子大学',
        'fuculty' => [
            0 => '国際文理学部',
        ],
        'class' => [
            0 => [
                0 => '国際教養学科',
                1 => '環境科学科',
                2 => '食・健康学科',
            ],
        ]
    ],
    400013029 => [
        'name' => '福岡大学',
        'fuculty' => [
            0 => '人文学部',
            1 => '法学部',
            2 => '経済学部',
            3 => '商学部',
            4 => '商学部第二部',
            5 => '理学部',
            6 => '工学部',
            7 => '医学部',
            8 => '薬学部',
            9 => 'スポーツ科学部',
        ],
        'class' => [
            0 => [
                0 => '文化学科',
                1 => '歴史学科',
                2 => '日本語日本文学科',
                3 => '教育・臨床心理学科',
                4 => '英語学科',
                5 => 'ドイツ語学科',
                6 => 'フランス語学科',
                7 => '東アジア地域言語学科',
            ],
            1 => [
                0 => '法律学科',
                1 => '経営法学科',
            ],
            2 => [
                0 => '経済学科',
                1 => '産業経済学科',
            ],
            3 => [
                0 => '商学科',
                1 => '経営学科',
                2 => '貿易学科',
            ],
            4 => [
                0 => '商学科',
            ],
            5 => [
                0 => '応用数学科',
                1 => '物理科学科',
                2 => '化学科',
                3 => '地球圏科学科',
            ],
            6 => [
                0 => '機械工学科',
                1 => '電気工学科',
                2 => '電子情報工学科',
                3 => '化学システム工学科',
                4 => '社会デザイン工学科',
                5 => '建築学科',
            ],
            7 => [
                0 => '医学科',
                1 => '看護学科',
            ],
            8 => [
                0 => '薬学科',
            ],
            9 => [
                0 => 'スポーツ科学科',
                1 => '健康運動科学科',
            ],
        ]
    ],
    400013030 => [
        'name' => '放送大学',
        'fuculty' => [
            0 => '教養学部',
        ],
        'class' => [
            0 => [
                0 => '生活と福祉',
                1 => '心理と教育',
                2 => '社会と産業',
                3 => '人間と文化',
                4 => '情報',
                5 => '自然と環境',
            ],
        ]
    ],
    400013031 => [
        'name' => '保健医療経営大学',
        'fuculty' => [
            0 => '保健医療経営学部',
        ],
        'class' => [
            0 => [
                0 => '保健医療経営学科',
            ],
        ]
    ],
];
